Dome2025/source/lectures/L03/cases/RandomDisks/0/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
877223
(
1e-18
1e-18
1e-18
1e-18
1e-18
1e-18
1e-18
1e-18
...
)
;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    solids
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
